#include <stdint.h>
#include <stdio.h>

#define M1 0x55555555
#define M2 0x33333333
#define M4 0x0f0f0f0f
#define M8 0x00ff00ff

// b1 b2 b3 b4
// b2 b1 b4 b3
// b4 b3 b2 b1
uint32_t reverseBits(uint32_t n) {
    n = ((n >> 1) & M1) | ((n & M1) << 1);
    n = ((n >> 2) & M2) | ((n & M2) << 2);
    n = ((n >> 4) & M4) | ((n & M4) << 4);
    n = ((n >> 8) & M8) | ((n & M8) << 8);

    return n >> 16 | n << 16;
}

int main()
{
    // 示例 1：
    // 输入：n = 00000010100101000001111010011100
    // 输出：964176192 (00111001011110000010100101000000)
    // 解释：输入的二进制串 00000010100101000001111010011100 表示无符号整数 43261596，
    //     因此返回 964176192，其二进制表示形式为 00111001011110000010100101000000。
    uint32_t n = 43261596;
    printf("%d\n", reverseBits(n));
}